app/Controllers/CrudController.php

SELECT *
FROM `noticies`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `noticies`
---
    public function index()
    {
        $noticiesModel = new NoticiesModel();

        $data['noticies'] = $noticiesModel->paginate(5, 'default');

SELECT *
FROM `noticies`
WHERE `noticies`.`id` = '6'
---
    public function readNoticia($id)
    {
        $model = new NoticiesModel();
        $noticia = $model->find($id);