app/Controllers/IndexController.php

SELECT *
FROM `noticies`
ORDER BY `created_at` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `noticies`
---
    public function index()
    {

    $noticiesModel = new NoticiesModel();
    $calendarioModel = new CalendarioModel();
    $config = new ConfigModel();

    $data = [
            'linkBannerPrincipal'  => $config->where('clau', 'linkBannerPrincipal')->first()['valor'] ?? '',
        ];

    $data['noticies'] = $noticiesModel->orderBy('created_at', 'DESC')->paginate(3, 'default');