app/Controllers/NoticiesController.php

SELECT *
FROM `noticies`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `noticies`
---
    public function index()
    {
        $noticiesModel = new NoticiesModel();

        $data['noticies'] = $noticiesModel->paginate(6, 'default');